jantielens/esp32-template-wifi/src/app/image_api.cpp
    UrlScheme scheme;
    size_t scheme_len = 0;
    uint16_t default_port = 0;

    if (starts_with_ignore_case(url, "https://")) {
        scheme = URL_SCHEME_HTTPS;
        scheme_len = 8;
        default_port = 443;
    } else if (starts_with_ignore_case(url, "http://")) {
        scheme = URL_SCHEME_HTTP;
        scheme_len = 7;
        default_port = 80;
    } else {
        return false;
    }

    const char* p = url + scheme_len; // after scheme://
    const char* slash = strchr(p, '/');
    const char* host_end = slash ? slash : (p + strlen(p));
    if (host_end <= p) return false;

    // Copy host[:port]
    const size_t hostport_len = (size_t)(host_end - p);
    if (hostport_len >= host_out_len) return false;
    char hostport[IMAGE_API_URL_MAX_LEN];
    memcpy(hostport, p, hostport_len);
    hostport[hostport_len] = '\0';

    // Split host and optional port
    const char* colon = strchr(hostport, ':');
    uint16_t port = default_port;
    if (colon) {
        const size_t host_len = (size_t)(colon - hostport);
        if (host_len == 0 || host_len >= host_out_len) return false;
        memcpy(host_out, hostport, host_len);
        host_out[host_len] = '\0';
        long parsed_port = strtol(colon + 1, nullptr, 10);
        if (parsed_port <= 0 || parsed_port > 65535) return false;
        port = (uint16_t)parsed_port;
    } else {
        if (strlen(hostport) >= host_out_len) return false;
        strncpy(host_out, hostport, host_out_len);
        host_out[host_out_len - 1] = '\0';
    }

    const char* path = slash ? slash : "/";
    if (strlen(path) >= path_out_len) return false;
    strncpy(path_out, path, path_out_len);
    path_out[path_out_len - 1] = '\0';

    *port_out = port;
    *scheme_out = scheme;
    return true;
}

static bool download_jpeg_to_buffer(
    const char* url,
    unsigned long timeout_ms,
    uint8_t** out_buf,
    size_t* out_sz,
    char* err,
    size_t err_len
) {
    if (!out_buf || !out_sz) return false;
    *out_buf = nullptr;
    *out_sz = 0;

    if (!url || strlen(url) == 0) {
        snprintf(err, err_len, "Missing URL");
        return false;
    }

    if (WiFi.status() != WL_CONNECTED) {
        snprintf(err, err_len, "WiFi not connected");
        return false;
    }

    UrlScheme scheme = URL_SCHEME_HTTPS;
    char host[128];
    char path[256];
    uint16_t port = 0;
    if (!parse_http_or_https_url(url, &scheme, host, sizeof(host), &port, path, sizeof(path))) {
        snprintf(err, err_len, "Invalid URL (must be http:// or https://)");
        return false;
    }

    // Keep a decode headroom guard on PSRAM boards (TLS + decode need internal heap).
#if SOC_SPIRAM_SUPPORTED
    if (psramFound()) {
        if (scheme == URL_SCHEME_HTTPS) {
            const size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
            if (internal_free < g_cfg.decode_headroom_bytes) {
                snprintf(err, err_len, "Insufficient internal heap for TLS/decode headroom");
                return false;
            }
        }
    }
#endif

    // Conservative per-operation timeout.
    // Note: `millis()` wraps; use wrap-safe elapsed checks.
    const unsigned long start_ms = millis();
    unsigned long effective_timeout_ms = timeout_ms;
    if (effective_timeout_ms == 0) effective_timeout_ms = 15000UL;
    // Clamp to avoid stalling the main loop for too long.
    if (effective_timeout_ms > 30000UL) effective_timeout_ms = 30000UL;

    const auto timed_out = [&]() -> bool {
        return (unsigned long)(millis() - start_ms) >= effective_timeout_ms;
    };

    WiFiClientSecure client_tls;
    WiFiClient client_plain;
    Client* client = nullptr;
    if (scheme == URL_SCHEME_HTTPS) {
        // SECURITY NOTE:
        // We intentionally use insecure TLS mode for now (no certificate validation)
        // to allow downloads from any host without shipping a CA bundle.
        // This protects against passive eavesdropping but NOT active MITM attacks.
        static bool warned_insecure_tls = false;
        if (!warned_insecure_tls) {
            warned_insecure_tls = true;
            Logger.logMessage(
                "ImageApi",
                "WARNING: HTTPS image_url uses insecure TLS (no certificate validation). A MITM can spoof content. Use only on trusted networks, or implement CA verification/pinning."
            );
        }
        client_tls.setInsecure();
        client = &client_tls;
    } else {
        client = &client_plain;
    }

    if (!client->connect(host, port)) {
        snprintf(err, err_len, "%s connect failed", scheme == URL_SCHEME_HTTPS ? "TLS" : "TCP");
        return false;
    }

    client->printf("GET %s HTTP/1.1\r\n", path);
    client->printf("Host: %s\r\n", host);
    client->print("User-Agent: esp32-template-image-api/1.0\r\n");
    client->print("Accept: image/jpeg, */*\r\n");
    client->print("Connection: close\r\n\r\n");

    // Read status + headers line-by-line to reduce stack usage.
    // (Avoids buffering the entire header block.)
    auto read_http_line = [&](char* out, size_t out_len) -> bool {
        if (!out || out_len == 0) return false;
        size_t n = 0;
        while (!timed_out()) {
            int b = client->read();
            if (b < 0) {
                delay(1);
                continue;
            }

            if (b == '\r') {
                continue;
            }

            if (b == '\n') {
                out[n] = '\0';
                return true;
            }

            if (n + 1 >= out_len) {
                snprintf(err, err_len, "HTTP header line too long");
                return false;
            }

            out[n++] = (char)b;
        }

        snprintf(err, err_len, "Timeout waiting for headers");
        return false;
    };

    char line[256];
    int status = 0;
    if (!read_http_line(line, sizeof(line))) {
        return false;
    }
    if (line[0] == '\0') {
        snprintf(err, err_len, "Invalid HTTP response");
        return false;
    }
    // Example: HTTP/1.1 200 OK
    if (sscanf(line, "HTTP/%*s %d", &status) != 1) {
        snprintf(err, err_len, "Failed to parse HTTP status");
        return false;
    }

    bool chunked = false;
    size_t content_length = 0;
    while (true) {
        if (!read_http_line(line, sizeof(line))) {
            return false;
        }

        // Empty line = end of headers
        if (line[0] == '\0') {
            break;
        }

        if (starts_with_ignore_case(line, "Content-Length:")) {
            const char* v = line + strlen("Content-Length:");
            while (*v == ' ' || *v == '\t') v++;
            content_length = (size_t)strtoul(v, nullptr, 10);
        } else if (starts_with_ignore_case(line, "Transfer-Encoding:")) {
            // If chunked, we bail for now (keeps implementation small + memory-predictable).
            if (strstr(line, "chunked") || strstr(line, "Chunked") || strstr(line, "CHUNKED")) {
                chunked = true;
            }
        }
    }

