jantielens/esp32-template-wifi/src/app/image_api.cpp
            // Decode without holding the LVGL mutex.
            const bool ok = lvgl_jpeg_decode_to_rgb565(buf, sz, &pixels, &w, &h, &scale_used, derr, sizeof(derr));
            if (!ok) {
                Logger.logMessagef("Portal", "ERROR: LVGL JPEG decode failed: %s", derr);
                device_telemetry_log_memory_snapshot("img lvgl-decode-fail");

                image_api_free((void*)pending_image_op.buffer);
                pending_image_op.buffer = nullptr;
                pending_image_op.size = 0;
                upload_state = UPLOAD_IDLE;

                if (g_backend.hide_current_image) {
                    g_backend.hide_current_image();
                }
                return;
            }

            LvglImageScreen* screen = display_manager_get_lvgl_image_screen();
            bool set_ok = false;
            display_manager_lock();
            if (screen) set_ok = screen->setImageRgb565(pixels, w, h);
            display_manager_unlock();

            // Helpful runtime diagnostics: show whether we decoded at reduced resolution.
            // The screen will scale this to a fixed 200x200 box via lv_img zoom.
            const int div = (scale_used >= 0 && scale_used <= 7) ? (1 << scale_used) : 0;
            const double zoom = (double)200.0 / (double)((w > h) ? w : h);
            if (div) {
                Logger.logMessagef(
                    "Portal",
                    "LVGL img: decoded %dx%d (tjpgd scale %d (1/%d)) -> target 200x200 (zoom %.2fx)",
                    w,
                    h,
                    scale_used,
                    div,
                    zoom
                );
            } else {
                Logger.logMessagef(
                    "Portal",
                    "LVGL img: decoded %dx%d (tjpgd scale %d) -> target 200x200 (zoom %.2fx)",
                    w,
                    h,
                    scale_used,
                    zoom
                );
            }

            if (!set_ok) {
                heap_caps_free(pixels);
                Logger.logMessage("Portal", "ERROR: Failed to set LVGL image");

                image_api_free((void*)pending_image_op.buffer);
                pending_image_op.buffer = nullptr;
                pending_image_op.size = 0;
                upload_state = UPLOAD_IDLE;

                if (g_backend.hide_current_image) {
                    g_backend.hide_current_image();
                }
                return;
            }

            device_telemetry_log_memory_snapshot("img lvgl-post");

            image_api_free((void*)pending_image_op.buffer);
            pending_image_op.buffer = nullptr;
            pending_image_op.size = 0;
            upload_state = UPLOAD_IDLE;
            return;
        }
        #endif

        bool success = false;
        if (g_backend.start_strip_session && g_backend.decode_strip) {
            #if HAS_DISPLAY
            // Serialize with LVGL task for the duration of the full decode.
            display_manager_lock();
            #endif

            if (!g_backend.start_strip_session(g_cfg.lcd_width, g_cfg.lcd_height, pending_image_op.timeout_ms, pending_image_op.start_time)) {
                Logger.logMessage("Portal", "ERROR: Failed to init image display");
                success = false;
            } else {
                success = g_backend.decode_strip(buf, sz, 0, false);
            }

            #if HAS_DISPLAY
            display_manager_unlock();
            #endif
        }

        device_telemetry_log_memory_snapshot("img post-decode");

        image_api_free((void*)pending_image_op.buffer);
        pending_image_op.buffer = nullptr;
        pending_image_op.size = 0;
        upload_state = UPLOAD_IDLE;

        if (!success) {
            Logger.logMessage("Portal", "ERROR: Failed to display image");
            device_telemetry_log_memory_snapshot("img decode-fail");
            if (g_backend.hide_current_image) {
                g_backend.hide_current_image();
            }
        }
        return;
    }

    // Invalid state
    upload_state = UPLOAD_IDLE;
}

#endif // HAS_IMAGE_API
